package com.javarush.task.task05.task0528;

/* 
Вывести на экран текущую дату в аналогичном виде «21 02 2014«.


Требования:
1. Дата должна содержать день, месяц и год, разделенные пробелом.
2. День должен соответствовать текущему.
3. Месяц должен соответствовать текущему.
4. Год должен соответствовать текущему.
5. Вся дата должна быть выведена в одной строке.
*/

import com.sun.org.apache.xpath.internal.SourceTree;

public class Solution {
    public static void main(String[] args) {
        System.out.println("09 07 2017");//напишите тут ваш код
    }
}
